<div class="menu module">
    <div class="module-content">
      <ul class="info-menu">

        <li class="info-menu-path">Для користувачів
          <ul class="info-menu-item">
            <li><a href="#">Загальна інформація</a></li>
            <li><a href="#">Вхід до системи</a></li>
            <li><a href="#">Елементи керування на карті</a></li>
            <li><a href="#">Перелік модулів та їх призначення</a></li>
            <li><a href="#">Адміністративний пошук</a></li>
            <li><a href="#">Вибір карти</a></li>
            <li><a href="#">Синтезоване зображення</a></li>
            <li><a href="#">ІС Геліос</a></li>
            <li><a href="#">Тематичний зміст</a></li>
            <li><a href="#">Редактор</a></li>
            <li><a href="#">Реєстрація подій</a></li>
          </ul>
        </li>

        <li class="info-menu-path">Для адміністраторів
          <ul class="info-menu-item">
            <li><a href="#">Вимоги до серверу</a></li>
            <li><a href="#">Перелік необхідних серверних модулів</a></li>
            <li><a href="#">Встановлення серверу Apache</a></li>
            <li><a href="#">Встановлення PHP процесора</a></li>
            <li><a href="#">Встановлення серверу баз данних MySQL</a></li>
            <li><a href="#">Встановлення серверу баз данних MSSQL</a></li>
            <li><a href="#">Встановлення системи ГІС</a></li>
            <li><a href="#">Вхід до адміністративної панелі</a></li>
            <li><a href="#">Розділи адміністративної панелі та їх призначення</a></li>
            <li><a href="#">Налаштування параметрів системи</a></li>
            <li><a href="#">Керування користувачами</a></li>
            <li><a href="#">Керування групами користувачів</a></li>
            <li><a href="#">Встановлення оновлень бази даних</a></li>
            <li><a href="#">Додаток1: Формат файлу фрагменту карти</a></li>

          </ul>
        </li>



      </ul>
    </div>
  </div>
</div>